# **셋(Set)의 특징**에 대한 설명 중 옳지 않은 것은 무엇인가요?
#
# 1. 셋은 중복된 요소를 허용하지 않는다.
# 2. 셋은 순서가 없는 자료형이다.
# 3. 셋은 인덱스를 사용해 요소에 접근할 수 있다.
# 4. 셋은 다양한 자료형을 요소로 가질 수 있다.
# 5. `add()` 메서드를 사용하여 새로운 요소를 추가할 수 있다.
# 정답 : 3번


# 다음 코드의 실행 결과를 고르세요.
#
# info = {'name': 'Kim', 'age': 30, 'city': 'Seoul'}
# print(info.get('country', 'Unknown'))
#
# 1. `'Kim'`
# 2. `30`
# 3. `'Seoul'`
# 4. `'Unknown'`
# 5. `None`
#정답 : 4번



1. `fruits`라는 셋을 선언하고 `'apple', 'banana', 'cherry'`를 추가하세요.
2. `print()`를 사용하여 `fruits`를 출력하세요.



1. `animals`라는 셋에 `'cat', 'dog', 'bird', 'fish'`를 저장하세요.
2. `'bird'`를 제거한 후, `print()`를 사용해 남은 요소를 출력하세요.