# 1. 사용자에게 "서울에 갈 계획이 있나요? (y/n): "를 입력받으세요.
# 2. 입력값이 `'y'`이면 **"서울로 간다!"**를 출력하세요.
def seoul_go(ans:str)->None:
    if ans =='y':
        print("서울로 간다!")
    else:
        pass

seoul_go(input("서울에 갈 계뢱이 있나요? (y/n):"))

# 1. 사용자에게 "집에 있는 가구를 다 가져갈까요? (y/n): "를 입력받으세요.
# 2. 입력값이 `'n'`이면 **"서울에서 가구를 새로 산다."**를 출력하세요.


# 1. 사용자에게 "현재 소지금은 얼마인가요? (숫자 입력): "을 입력받으세요.
# 2. 입력값이 `50000` 이상이면 **"기차표를 구매했다!"**를 출력하세요.


# 1. 사용자에게 "오늘 서울 날씨는 맑음인가요? (y/n): "를 입력받으세요.
# 2. 입력값이 `'y'`이면 **"서울 구경을 나간다."**를 출력하세요.
# 3. 입력값이 `'n'`이면 **"집에서 쉰다."**를 출력하세요.


# 1. 사용자에게 "월세 예산은 얼마인가요? (숫자 입력): "를 입력받으세요.
# 2. 입력값이 `1000000` 이하이면 **"고시원에서 산다."**를 출력하세요.
# 3. 그 외의 경우 **"원룸을 계약한다."**를 출력하세요.


# 1. 사용자에게 "원하는 직장 종류를 입력하세요 (프리랜서/중소기업/대기업): "를 입력받으세요.
# 2. 입력값이 `'프리랜서'`이면 **"시간은 자유롭지만 불안정하다."**를 출력하세요.
# 3. 입력값이 `'중소기업'`이면 **"안정적이지만 일이 많다."**를 출력하세요.



# 1. 사용자에게 "아침에 일어나는 시간을 입력하세요 (숫자 입력, 6~10): "를 입력받으세요.
# 2. 입력값이 6이면 **"운동을 한다."**를 출력하세요.
# 3. 입력값이 7이면 **"공부를 한다."**를 출력하세요.
# 4. 입력값이 8이면 **"바로 출근 준비를 한다."**를 출력하세요.





# 1. 사용자에게 "오늘 날씨가 어떤가요? (맑음/비/눈): "를 입력받으세요.
# 2. 입력값이 `'맑음'`이면 **"한강에 가서 피크닉을 즐기는 척하며 일을 한다."**를 출력하세요.
# 3. 입력값이 `'비'`이면 **"집에서 빗소리를 ASMR 삼아 일을 한다."**를 출력하세요.
# 4. 입력값이 `'눈'`이면 **"전기장판 안에서 귤을 까먹으며 일을 한다."**를 출력하세요.
# 5. 그 외의 값이 입력되면 **"암막 커튼 때문에 일어나지 못했다. 푹 잘 수 있군, 럭키비키잖아?"**를 출력하세요.